class Предмети:
    pass
class Неживі(Предмети):
    pass
class Живі(Предмети):
    pass
class Тротуари(Неживі):
    pass
class Тварини(Живі):
    def харчуватись_їжею(self):
        print("харчується їжею")
    def рухатись(self):
        print("рухається")
    def дихати(self):
        print("дихає")
class Савці(Тварини):
    def годувати_дитинчат_молоком(self):
        print("годує дитинчат")
class Жирафи(Савці):
    def їсти_листя_з_дерев(self):
        self.харчуватись_їжею()
    def шукати_їжу(self):
        self.рухатись()
        print("Я знайшов їжу")
        self.харчуватись_їжею()
    def танцювати(self):
        print("ліва нога вперед")
        print("ліва нога назад")
        print("права нога вперед")
        print("права нога назад")
        print("ліва нога назад")
        print("права нога назад")
        print("права нога вперед")
        print("ліва нога вперед")
    def __init__(self, плями):
        self.жирафові_плями = плями
реджинальд =Жирафи(100)
гарольд = Жирафи(150)